# IFC_DefPsetAddMember

## Description
Adds a new member to the currently defined Custom Object Preset.

```pascal
FUNCTION IFC_DefPsetAddMember(
				psetName : STRING;
				propName : STRING;
				propType : STRING) : BOOLEAN;
```

```python

def vs.IFC_DefPsetAddMember(psetName, propName, propType):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|psetName|STRING||
|propName|STRING||
|propType|STRING||

## Version
Availability: from Vectorworks 2016
## Category
* IFC